export const introduceData = [
	{
		question: "Q. 퍼블리셔를 선택한 이유는 무엇인가요?",
		answer: "웹 퍼블리싱은 코드 한 줄 한 줄이 즉각적으로 화면에 반영되는 과정이 매력적이었습니다. 디자인과 개발의 경계에서 사용자 경험을 더욱 직관적이고 아름답게 만드는 일이 흥미로웠고 특히 UI/UX 설계와 구현 과정에서 큰 보람을 느낍니다. 직접 구축한 화면이 사용자에게 전달되는 과정이 저를 퍼블리셔의 길로 이끌었습니다.",
	},
	{
		question: "Q. 어떤 강점을 가지고 있나요?",
		answer: "저는 그래픽아츠과(편집&인쇄) 전공을 바탕으로 시각적인 디자인 감각과 KDT 프론트엔드 수강 경험을 통해 퍼블리싱 기술을 함께 갖추고 있습니다. 프론트엔드 과정을 수강하며 HTML5, CSS3, JavaScript, TypeScript, React, Next.js 등의 기술을 익혔으며, 특히 UI/UX 개선을 위한 퍼블리싱 작업에 강점을 가지고 있습니다. 또한 실제 기업 프로젝트에서 웹사이트 리디자인, 퍼블리싱, 이메일 전송 시스템 구현 등의 경험을 쌓아 실무적인 감각도 익혔습니다.",
	},
	{
		question: "Q. 협업할 때 중요하게 생각하는 점은 무엇인가요?",
		answer: "퍼블리셔는 디자이너와 개발자 사이에서 소통하며 조화를 이루는 역할을 한다고 생각합니다. 저는 프로젝트 진행 시 의사소통을 중요하게 생각하며 팀원들의 피드백을 적극적으로 반영해 더 나은 결과물을 만들어내려고 노력하고 있습니다.",
	},
];

export const schoolData = [
  {
    subTitle: "신구대학교 그래픽아츠과(4년제)",
    body: "그래픽아츠과는 인쇄공학과 디자인이 결합된 학문으로, 인쇄 및 디자인 제작 전반의 실무 역량을 학습하였습니다. 인쇄 미디어 기술과 컴퓨터 그래픽 응용을 통해 기획, 디자인, 제작의 전반적인 과정을 학습하여 전문적인 직무 수행 능력을 함양하였습니다.",
    meta: {
      first: "2021.03 ~ 2023.02",
      second: "공학사",
      third: "학점: 3.6/4.5",
    },
  },
  {
    subTitle: "신구대학교 그래픽아츠과(2년제)",
    body: "그래픽아츠과는 인쇄공학과 디자인이 결합된 학문으로, 인쇄 및 디자인 제작 전반의 실무 역량을 학습하였습니다. 인쇄 미디어 기술과 컴퓨터 그래픽 응용을 통해 기획, 디자인, 제작의 전반적인 과정을 학습하여 전문적인 직무 수행 능력을 함양하였습니다.",
    meta: {
      first: "2015.03 ~ 2021.02",
      second: "전문공학사",
      third: "학점: 3.1/4.5",
    },
  },
];

export const careerData = [
  {
    subTitle: "주식회사 엔아이",
    body: "주식회사 엔아이에서 웹 퍼블리셔로 근무하며 사용자 경험 개선을 목표로 웹사이트 디자인 및 퍼블리싱 업무를 수행하였으며 React, Next.js 프레임워크를 활용한 반응형 웹 최적화 작업을 진행하였습니다. 이와 더불어, 서비스 및 제품 홍보를 위한 사진 수집 및 정리, 이미지 자료 관리 등의 보조 업무를 수행하며 웹사이트에 적합한 비주얼 콘텐츠를 구성하였습니다.",
    meta: {
      first: "2023.10 ~ 2024.05",
      second: "경영악화로 인한 비자발적 퇴사",
      third: "퍼블리셔",
    },
  },
];

export const educationData = [
	{
    subTitle: "웹 개발부터 웹앱까지 프론트엔드의 모든 것",
    body: "React 및 Next.js를 활용한 프론트엔드 개발을 학습하였으며 HTML, CSS, JavaScript, TypeScript를 기반으로 웹 UI 및 반응형 웹사이트를 구현하였습니다. API 연동 및 백엔드 통신(SSR, SSG, React-Query)을 통해 데이터를 효율적으로 관리하였습니다. 또한, 성능 최적화(Streaming, Server Components)를 적용해 보았습니다.",
    meta: {
			first: "2023.07 ~ 2023.09",
      second: "패스트캠프",
      third: "수료",
    },
  },
  {
    subTitle: "프론트엔드(React) 웹&앱 SW개발자 양성과정",
    body: "React를 활용한 프론트엔드 개발과 웹표준(HTML, CSS) 및 웹 프로그래밍을 익히며 UI/UX 웹 퍼블리싱, 하이브리드 앱(PWA) 개발, SPA 프로젝트 등을 수행하여 컴포넌트 기반 개발과 전반적인 웹 개발 기술을 습득하였습니다. 또한, 팀 프로젝트를 통해 GitHub을 활용한 협업 프로세스를 경험하였으며 코드 리뷰 및 Git Flow 기반의 브랜치 전략을 적용하여 체계적인 개발 및 배포 관리 방법을 익혔습니다.",
    meta: {
      first: "2023.01 ~ 2023.07",
      second: "그린컴퓨터아카데미",
      third: "수료",
    },
  },
];